wmsmobile/src/Documents/итНаборка/итНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итНаборка</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FSRARID</name>
    <comment>ид для печати SSCC</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйПризнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wmsmobile/src/InformationRegisters/ИтЗадачиНаТСД/ИтЗадачиНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтЗадачиНаТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучательПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итНаборка</types>
      <types>DocumentRef.итОтгрузка</types>
      <types>DocumentRef.итПриемка</types>
      <types>DocumentRef.итЗадачиИнвентаризации</types>
      <types>DocumentRef.итПеремещение</types>
      <types>DocumentRef.итКонтрольнаяАгрегация</types>
      <types>DocumentRef.итРазмещение</types>
      <types>DocumentRef.итПроверка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wmsmobile/src/Enums/итWMSСостоянияЗадачТСД/итWMSСостоянияЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСостоянияЗадачТСД</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРазрешения</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

wmsmobile/src/Documents/итНаборка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗадачиТСД.Параметры.УстановитьЗначениеПараметра("ДокументОснование",Объект.Ссылка);
	Элементы.ДатаНомерЗаказа.Заголовок=Объект.ЗаказНаборки;
	АнализЗадач();
КонецПроцедуры


&НаСервере
Процедура АнализЗадач()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИтЗадачиНаТСД.ИдЗадачи) КАК ИдЗадачи
		|ИЗ
		|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
		|ГДЕ
		|	ИтЗадачиНаТСД.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если  ВыборкаДетальныеЗаписи.ИдЗадачи = 0 Тогда 
			Элементы.ЗадачОсталось.Заголовок="0";   
		иначе
			Элементы.ЗадачОсталось.Заголовок="Осталось выполнить задач: "+ВыборкаДетальныеЗаписи.ИдЗадачи;
		КонецЕсли;
	иначе
		Элементы.ЗадачОсталось.Заголовок="0";   
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
	АнализЗакрытияФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура АнализЗакрытияФормы()
	Если Элементы.ЗадачОсталось.Заголовок="0" Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		 ОбработчкаПолученияДанныхШтрихКода(Параметр);
	 КонецЕсли;
	 Если ИмяСобытия="ОбновлениеДанныхДинамическихСписков" и Источник=ОбщийМодульКлиентскойЧасти тогда
		Элементы.ЗадачиТСД.Обновить();
		АнализЗадач();
		АнализЗакрытияФормы();
	 КонецЕсли;
 КонецПроцедуры
 
&НаКлиенте 
Процедура ОбработчкаПолученияДанныхШтрихКода(Параметр)
Задача=НайтиЗадачуНаСервере(Параметр);
Если Задача<> Неопределено Тогда
	ОткрытьФорму("Документ.итНаборка.Форма.ФормаЗадачиДокумента",новый Структура("Ключ,ИдЗадачи,ОткрытиеСчитыванием",Объект.Ссылка,Задача,Истина),ЭтаФорма);
КонецЕсли;
ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаСервере
Функция НайтиЗадачуНаСервере(Параметр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтЗадачиНаТСД.ИдЗадачи КАК ИдЗадачи
		|ИЗ
		|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
		|ГДЕ
		|	ИтЗадачиНаТСД.ИдентификаторУпаковки = &ИдентификаторУпаковки";
	
	Запрос.УстановитьПараметр("ИдентификаторУпаковки", Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат ВыборкаДетальныеЗаписи.ИдЗадачи;
	КонецЦикла;
	
	Возврат Неопределено;	
	КонецФункции

&НаКлиенте
Процедура ЗадачиТСДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.итНаборка.Форма.ФормаЗадачиДокумента",новый Структура("Ключ,ИдЗадачи,ОткрытиеСчитыванием",Объект.Ссылка,Элементы.ЗадачиТСД.ТекущиеДанные.ИдЗадачи),ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтказатьсяОтЗадачДокументаНаСервере()
	МассивДанных=ПолучитьДанныеДляИнициализации();
	Для Каждого стр из МассивДанных цикл
	 ОбработчикДанныхОбщиеФункцииИПроцедуры.ИнициализацияЗадачиНаСервере(стр,"ЗадачаОтказ",Перечисления.итWMSСостоянияЗадачТСД.КВыполнению)
	КонецЦикла;
КонецПроцедуры
&НаСервере
Функция ПолучитьДанныеДляИнициализации()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИтЗадачиНаТСД.ИдЗадачи КАК ИдЗадачи,
	|	ИтЗадачиНаТСД.ТипЗадачи КАК ТипЗадачи,
	|	ИтЗадачиНаТСД.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
	|ГДЕ
	|	ИтЗадачиНаТСД.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование",Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивДанных=новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураДанных=новый Структура;
		для Каждого Колонка из РезультатЗапроса.Колонки цикл
			СтруктураДанных.Вставить(Колонка.Имя,ВыборкаДетальныеЗаписи[Колонка.Имя]);
		КонецЦикла;
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;
	Возврат МассивДанных;
КонецФункции
&НаКлиенте
Процедура ОтказатьсяОтЗадачДокументаОповещение(Результат,Параметры) Экспорт 
	Если Результат=КодВозвратаДиалога.Нет Тогда 
		Возврат
	КонецЕсли;	
	ОтказатьсяОтЗадачДокументаНаСервере();
	АнализЗадач();
	АнализЗакрытияФормы();
	КонецПроцедуры
&НаКлиенте
Процедура ОтказатьсяОтЗадачДокумента(Команда)
	Оповещение=новый ОписаниеОповещения("ОтказатьсяОтЗадачДокументаОповещение",ЭтаФорма);
	ПоказатьВопрос(Оповещение,"Вы уверены, что хотите отказаться от задач документа?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьSSCCФилиала(Команда)
	ОткрытьФорму("Документ.итНаборка.Форма.ФормаГрупповойПечатиSSCCФилиала",новый Структура("ОбъектНаборки",Объект.Ссылка),ЭтаФорма);
	ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры
